yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_ETH_lwip/STM32F2_ETH_driver.cpp
/*
 * Copyright 2011 CSA Engineering AG
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
 
/*********************************************************************************************
 * @file    STM32F2_ETH_driver.cpp
 * @brief   STM32F2 ethernet driver. 
 * @author  CSA Engineering AG, Switzerland, www.csa.ch, info@csa.ch
 * @date    March 2012
 ********************************************************************************************/
  
//--------------------------------------------------------------------------------------------
// System and local includes
//--------------------------------------------------------------------------------------------
 
#include <tinyhal.h>

#include "STM32F2_ETH_driver.h"

//--------------------------------------------------------------------------------------------
// Constant defines
//--------------------------------------------------------------------------------------------

// Debug switches
#define DEBUG_DMA_INT               0

// PHY
#define PHY_ADDRESS                     0x01U           // PHY address

// MACMIIAR
#define MACMIIAR_PA_POSITION            11U             // PHY address bit position
#define MACMIIAR_MR_POSITION            6U              // MII register bit position
#define MII_BUSY_TIMEOUT                0x00000FFFU     // PHY read and write register timeout

// Timeouts
#define MAC_RESET_TIMEOUT               0x00000FFFU     // MAC reset timeout
#define FLUSH_TX_FIFO_TIMEOUT           0x00000FFFU     // Flush TX FIFO timeout

// Enable normal DMA interrupts
#define INT_ENABLE_NIS        1                         // Normal interrupt summary
#define INT_ENABLE_TI         0                         // Transmit
#define INT_ENABLE_TBUI       0                         // Transmit buffer unavailable
#define INT_ENABLE_RI         1                         // Receive
#define INT_ENABLE_ERI        0                         // Early receive
// Enable abnormal DMA interrupts
#define INT_ENABLE_AIS        1                         // Abnormal interrupt summary
#define INT_ENABLE_TPSI       1                         // Transmit process stopped
#define INT_ENABLE_TJTI       1                         // Transmit jabber timeout
#define INT_ENABLE_ROI        1                         // Receive overflow
#define INT_ENABLE_TUI        1                         // Transmit underflow
#define INT_ENABLE_RBUI       1                         // Receive buffer unavailable
#define INT_ENABLE_RPSI       1                         // Receive process stopped
#define INT_ENABLE_RWTI       1                         // Receive watchdog timeout
#define INT_ENABLE_ETI        0                         // Early transmit
#define INT_ENABLE_FBEI       1                         // Fatal bus error

//--------------------------------------------------------------------------------------------
// Local declarations
//--------------------------------------------------------------------------------------------

static void (*receiveIntHandler)();

//--------------------------------------------------------------------------------------------
// Local functions declarations
//--------------------------------------------------------------------------------------------

static void enableDmaInterrupts();
static void disableDmaInterrupts();
static void flushTxFifo();
static void initMACCR();
static void initMACFFR();
static void initMACMIIAR();
static void initMACFCR();
static void initMACIMR();
static void initDMABMR();
static void initDMAOMR();
static BOOL readPhyRegister(const uint32_t miiAddress, uint16_t *const miiData);
static BOOL writePhyRegister(const uint32_t miiAddress, const uint16_t miiData);

//--------------------------------------------------------------------------------------------
// Functions definitions
//--------------------------------------------------------------------------------------------
/**
 * Initialize the DMA and MAC modules.
 * @return Error status.
 *   @retval TRUE if initialization successful.
 *   @retval FALSE otherwise.
 */
void eth_initDmaMacRegisters()
{
    // Init DMA and MAC registers
    initMACMIIAR();
    initMACCR();
    initMACFFR();
    initMACFCR();
    initDMAOMR();
    initDMABMR();
    initMACIMR();
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize the 6-byte MAC address of the ethernet interface.
 * @param pAddress a pointer to the MAC address.
 */
void eth_initMacAddress(const uint8_t *const pAddress)
{
    // Initialize ETH_MACA0HR, the ethernet MAC address 0 high register
    ETH->MACA0HR &= ((uint32_t)pAddress[5] << 8U) |
                    ((uint32_t)pAddress[4]);
    
    // Initialize ETH_MACA0LR, the ethernet MAC address 0 low register
    ETH->MACA0LR =  ((uint32_t)pAddress[3] << 24U) |
                    ((uint32_t)pAddress[2] << 16U) |
                    ((uint32_t)pAddress[1] << 8U)  |
                    ((uint32_t)pAddress[0]);
 }

//--------------------------------------------------------------------------------------------
/**
 * Select the MII interface.
 */ 
void eth_selectMii()
{
    // Select MII interface
    RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
    SYSCFG->PMC &= ~SYSCFG_PMC_MII_RMII;
    RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
}

//--------------------------------------------------------------------------------------------
/**
 * Enable the ethernet clocks.
 */ 
void eth_enableClocks()
{
    // Enable ethernet clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACRXEN;
    RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACTXEN;
    RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACEN;
}

//--------------------------------------------------------------------------------------------
/**
 * Disable the ethernet clocks.
 */ 
void eth_disableClocks()
{
    // Disable ethernet clocks
    RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACRXEN;
    RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACTXEN;
    RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACEN;    
}

//--------------------------------------------------------------------------------------------
/**
 * Reset the MAC module. Wait until the reset operation completes or until a timeout elapses.
 * @return Error status.
 *   @retval TRUE if reset successful.
 *   @retval FALSE if timeout elapsed.
 */
BOOL eth_macReset()
{
    volatile uint32_t nWait = 0U;
    BOOL retval = TRUE;
    
