yangjunjiao/NetmfSTM32/DeviceCode/Targets/Native/STM32F2/DeviceCode/STM32F2_ETH_lwip/STM32F2_ETH_driver.cpp
    // Software reset
    ETH->DMABMR |= ETH_DMABMR_SR;
    
    // Wait for completion
    while ( ((ETH->DMABMR & ETH_DMABMR_SR) == ETH_DMABMR_SR) && 
            (nWait < MAC_RESET_TIMEOUT) )
    {
        nWait++;
    }
    
    // Check whether timeout elapsed
    if (nWait == MAC_RESET_TIMEOUT)
    {
        retval = FALSE;
    }
    
    return retval;
}

//--------------------------------------------------------------------------------------------
/**
 * Enable ethernet communication.
 */
void eth_enableTxRx()
{
    // Enable DMA interrupts
    enableDmaInterrupts();
    
    // Start MAC and DMA transmission
    flushTxFifo();
    ETH->MACCR |= ETH_MACCR_TE;
    ETH->DMAOMR |= ETH_DMAOMR_ST;

    // Start DMA and MAC reception
    ETH->DMAOMR |= ETH_DMAOMR_SR;
    ETH->MACCR |= ETH_MACCR_RE;
}

//--------------------------------------------------------------------------------------------
/**
 * Disable ethernet communication.
 */
void eth_disableTxRx()
{
    // Stop MAC and DMA reception
    ETH->MACCR &= ~ETH_MACCR_RE;
    ETH->DMAOMR &= ~ETH_DMAOMR_SR;
    
    // Stop DMA and MAC transmission
    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
    ETH->MACCR &= ~ETH_MACCR_TE;
    
    // Disable DMA interrupts
    disableDmaInterrupts();
}
 
//--------------------------------------------------------------------------------------------
/**
 * Resume DMA transmission.
 */
void eth_resumeDmaTransmission()
{
    if ((ETH->DMASR & ETH_DMASR_TPS) == ETH_DMASR_TPS_Suspended)
    {
        // Resume DMA transmission
        ETH->DMATPDR = ETH_DMATPDR_TPD;
    }
}

//--------------------------------------------------------------------------------------------
/**
 * Resume DMA reception.
 */
void eth_resumeDmaReception()
{
    if ((ETH->DMASR & ETH_DMASR_RPS) == ETH_DMASR_RPS_Suspended)
    {
        // Resume DMA reception
        ETH->DMARPDR = ETH_DMARPDR_RPD;
    }
}

//--------------------------------------------------------------------------------------------
/**
 * Ethernet interrupt handler
 */
void eth_dmaInterruptHandler()
{
    #if defined (_DEBUG) && DEBUG_DMA_INT
    debug_printf("DMA Int:");
    #endif

    // Normal interrupt summary
    if ((ETH->DMASR & ETH_DMASR_NIS) == ETH_DMASR_NIS)
    {
        #if INT_ENABLE_RI
        if ((ETH->DMASR & ETH_DMASR_RS) == ETH_DMASR_RS)
        {
            // Ethernet frame received
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" RS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RS;

            // Process receive interrupt
            if (receiveIntHandler)
            {
                receiveIntHandler();
            }
        }
        #endif
        #if INT_ENABLE_TI
        if ((ETH->DMASR & ETH_DMASR_TS) == ETH_DMASR_TS)
        {
            // Ethernet frame sent
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" TS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TS;
        }
        #endif
        #if INT_ENABLE_TBUI
        if ((ETH->DMASR & ETH_DMASR_TBUS) == ETH_DMASR_TBUS)
        {
            // Transmit buffer unavailable
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" TBUS");
            #endif

            // Clear interrupt flag, transmition is resumed after descriptors have been prepared
            ETH->DMASR = ETH_DMASR_TBUS;
        }
        #endif
        #if INT_ENABLE_ERI
        if ((ETH->DMASR & ETH_DMASR_ERS) == ETH_DMASR_ERS)
        {
            // Early receive
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" ERS");
            #endif

            // Clear interrupt flag. Also cleared automatically by RI
            ETH->DMASR = ETH_DMASR_ERS;
        }
        #endif

        // Clear normal interrupt flag
        ETH->DMASR = ETH_DMASR_NIS;
    }

    // Abnormal interrupt summary
    if ((ETH->DMASR & ETH_DMASR_AIS) == ETH_DMASR_AIS)
    {
        #if INT_ENABLE_FBEI
        if ((ETH->DMASR & ETH_DMASR_FBES) == ETH_DMASR_FBES)
        {
            // Fatal bus error
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" FBES");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_FBES;
        }
        #endif
        #if INT_ENABLE_TPSI
        if ((ETH->DMASR & ETH_DMASR_TPSS) == ETH_DMASR_TPSS)
        {
            // Transmit process stopped
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" TPSS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TPSS;
        }
        #endif
        #if INT_ENABLE_TJTI
        if ((ETH->DMASR & ETH_DMASR_TJTS) == ETH_DMASR_TJTS)
        {
            // Transmit jabber timeout
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" TJTS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TJTS;
        }
        #endif
        #if INT_ENABLE_ROI
        if ((ETH->DMASR & ETH_DMASR_ROS) == ETH_DMASR_ROS)
        {
            // Receive overflow
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" ROS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_ROS;
        }
        #endif
        #if INT_ENABLE_TUI
        if ((ETH->DMASR & ETH_DMASR_TUS) == ETH_DMASR_TUS)
        {
            // Transmit underflow
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" TUS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TUS;
        }
        #endif
        #if INT_ENABLE_RBUI
        if ((ETH->DMASR & ETH_DMASR_RBUS) == ETH_DMASR_RBUS)
        {
            // Receive buffer unavailable
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" RBUS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RBUS;
        }
        #endif
        #if INT_ENABLE_RPSI
        if ((ETH->DMASR & ETH_DMASR_RPSS) == ETH_DMASR_RPSS)
        {
            // Receive process stopped
            #if defined (_DEBUG) && DEBUG_DMA_INT
            debug_printf(" RPSS");
            #endif

